       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CPY001
           REPLACING ==OLD-NAME== BY ==NEW-NAME==.
       PROCEDURE DIVISION.
           GOBACK.
