       IDENTIFICATION DIVISION.
       PROGRAM-ID. AIR-MOVE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(5).

       PROCEDURE DIVISION.
           MOVE 'PROGA' TO WS-PGM.
           GOBACK.

       END PROGRAM AIR-MOVE.
