       IDENTIFICATION DIVISION.
       PROGRAM-ID. PREORDER-CONFLICT.
       DATA DIVISION.
       FILE SECTION.
       FD CONFLICTING-FILE EXTERNAL GLOBAL.
       01 FILE-RECORD PIC X.
       WORKING-STORAGE SECTION.
       01 CONFLICTING-ITEM EXTERNAL GLOBAL PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM PREORDER-CONFLICT.
