       IDENTIFICATION DIVISION.
       PROGRAM-ID. PREORDER-THRU.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 LOOP-COUNT PIC 9 VALUE 0.
       01 LOOP-LIMIT PIC 9 VALUE 3.
       PROCEDURE DIVISION.
           PERFORM FIRST-PARA THRU LAST-PARA
               UNTIL LOOP-COUNT > LOOP-LIMIT.
           GOBACK.
       FIRST-PARA.
           CONTINUE.
       LAST-PARA.
           CONTINUE.
       END PROGRAM PREORDER-THRU.
