       IDENTIFICATION DIVISION.
       PROGRAM-ID. PREORDER-CONFLICT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CONFLICTING-ITEM EXTERNAL GLOBAL PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM PREORDER-CONFLICT.
