       IDENTIFICATION DIVISION.
       PROGRAM-ID. PREORDER-UNTIL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 LOOP-STOP PIC X VALUE 'N'.
       01 LOOP-COUNT PIC 9 VALUE 0.
       PROCEDURE DIVISION.
           PERFORM TARGET-PARA UNTIL
               LOOP-STOP = 'Y' OR LOOP-COUNT > 3.
           GOBACK.
       TARGET-PARA.
           CONTINUE.
       END PROGRAM PREORDER-UNTIL.
