       IDENTIFICATION DIVISION.
       PROGRAM-ID. DFHPRECEDENCE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SINK PIC 9.
       01 IDX PIC 9.
       01 DFHRESP OCCURS 10 TIMES PIC 9.
       01 DFHVALUE OCCURS 10 TIMES PIC 9.
       PROCEDURE DIVISION.
           MOVE DFHRESP(IDX) TO SINK.
           MOVE DFHVALUE(IDX) TO SINK.
           GOBACK.
       END PROGRAM DFHPRECEDENCE.
