       IDENTIFICATION DIVISION.
       PROGRAM-ID. DFHNEGATIVE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-RESP PIC S9(8) COMP.
       01 SINK PIC S9(8) COMP.
       PROCEDURE DIVISION.
           MOVE MY-TABLE(IDX) TO SINK.
           MOVE DFHOTHER(X) TO SINK.
           MOVE DFHRESP TO SINK.
           MOVE DFHVALUE TO SINK.
           MOVE DFHRESP OF HOLDER(IDX) TO SINK.
           MOVE DFHVALUE OF HOLDER(IDX) TO SINK.
           IF WS-RESP = DFHVALUE(IDX)(1:2)
               CONTINUE
           END-IF.
           GOBACK.
       END PROGRAM DFHNEGATIVE.
