       IDENTIFICATION DIVISION.
       PROGRAM-ID. DFHDATAITEMS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SINK PIC 9.
       01 DFHRESP PIC 9.
       01 DFHVALUE PIC 9.
       PROCEDURE DIVISION.
           MOVE DFHRESP TO SINK.
           MOVE DFHVALUE TO SINK.
           GOBACK.
       END PROGRAM DFHDATAITEMS.
