       IDENTIFICATION DIVISION.
       PROGRAM-ID. NEXT-IF.
       PROCEDURE DIVISION.
           IF 1 = 1
               NEXT SENTENCE
           ELSE
               CONTINUE
           END-IF
           CONTINUE.
           GOBACK.
       END PROGRAM NEXT-IF.
