       IDENTIFICATION DIVISION.
       PROGRAM-ID. NOMTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SELECTOR PIC 9.
       01 SORT-KEY PIC X.
       PROCEDURE DIVISION.
           GO TO TARGET-PARA.
           GO TO FIRST-PARA SECOND-PARA DEPENDING ON SELECTOR.
           GO TO TARGET-PARA OF TARGET-SECTION.
           PERFORM FIRST-PARA.
           PERFORM FIRST-PARA THRU SECOND-PARA.
           ALTER FIRST-PARA TO PROCEED TO SECOND-PARA.
           SORT SORT-FILE ON ASCENDING KEY SORT-KEY
             INPUT PROCEDURE FIRST-PARA THRU SECOND-PARA
             USING INPUT-FILE
             OUTPUT PROCEDURE TARGET-PARA OF TARGET-SECTION
             GIVING OUTPUT-FILE.
           MERGE MERGE-FILE ON ASCENDING KEY SORT-KEY
             USING INPUT-FILE
             OUTPUT PROCEDURE FIRST-PARA THROUGH SECOND-PARA
             GIVING OUTPUT-FILE.
           CALL 'STATIC-PGM'.
       FIRST-PARA.
           CONTINUE.
       SECOND-PARA.
           CONTINUE.
       TARGET-SECTION SECTION.
       TARGET-PARA.
           GOBACK.
