       IDENTIFICATION DIVISION.
       PROGRAM-ID. EVALTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC X.
       01 FLAG PIC X.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'OLDPROG' TO WS-PGM.
       EVALUATE WS-X
        WHEN 'A'
         MOVE 'PROGA' TO WS-PGM
       END-EVALUATE
       CALL WS-PGM.
       GOBACK.
