       IDENTIFICATION DIVISION.
       PROGRAM-ID. EVALTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC X.
       01 FLAG PIC X.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
       MAIN.
       EVALUATE WS-X
        WHEN 'A'
         PERFORM DEFINE-PGM
        WHEN OTHER
         MOVE 'PROGC' TO WS-PGM
       END-EVALUATE
       CALL WS-PGM.
       GOBACK.
       DEFINE-PGM.
       MOVE 'PROGA' TO WS-PGM.
