       IDENTIFICATION DIVISION.
       PROGRAM-ID. EVALTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC X.
       01 FLAG PIC X.
       01 WS-PGM PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'OLD' TO WS-PGM.
       EVALUATE WS-X
        WHEN 'A'
         MOVE 'NEW1' TO WS-PGM
         MOVE 'NEW2' TO WS-PGM
        WHEN OTHER
         MOVE 'OTHER' TO WS-PGM
       END-EVALUATE
       CALL WS-PGM.
       GOBACK.
