       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       DELETE FROM HISTORICO WHERE ID IN (SELECT ID FROM CLIENTE)
       END-EXEC.
       GOBACK.
