       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPY-NORMALIZED.
       AUTHOR. ENTRY INSIDE COPY. WITH PERIODS.
           SECOND ENTRY RECORD WITHOUT PERIOD
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY FIELDS.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO
      -' FROM COPY'.
           GOBACK.
