       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       COMMIT; SELECT * FROM HIDDEN
       END-EXEC.
       GOBACK.
