       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       WITH A AS (SELECT * FROM CLIENTE), B AS (SELECT * FROM A
       JOIN CONTA C ON A.ID=C.ID) SELECT * FROM B
       END-EXEC.
       GOBACK.
