       IDENTIFICATION DIVISION.
       PROGRAM-ID. FAMILY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MAIN.
       PERFORM A THRU C.
       CALL WS-PGM.
       GOBACK.
       A.
       EVALUATE FLAG WHEN 'Y' MOVE 'PROGA' TO WS-PGM WHEN OTHER MOVE
       'PROGB' TO WS-PGM END-EVALUATE.
       B.
       MOVE WS-PGM TO WS-PGM.
       C.
       MOVE WS-PGM TO WS-PGM.
