       IDENTIFICATION DIVISION.
       PROGRAM-ID. FAMILY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       01 FLAG PIC X.
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'OLDPROG' TO WS-PGM.
       PERFORM A WITH TEST AFTER UNTIL FLAG = 'Y'.
       CALL WS-PGM.
       GOBACK.
       A.
       IF FLAG = 'X' MOVE 'PROGA' TO WS-PGM ELSE MOVE 'PROGB' TO WS-PGM
       END-IF.
