       IDENTIFICATION DIVISION.
       PROGRAM-ID. FAMILY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM PIC X(8).
       01 FLAG PIC X.
       01 I PIC S9(9).
       01 LIM PIC 9(9).
       01 J PIC 9(9).
       PROCEDURE DIVISION.
       MAIN.
       MOVE 'OLDPROG' TO WS-PGM.
       PERFORM A VARYING I FROM MISSING BY 1 UNTIL I > LIM.
       CALL WS-PGM.
       GOBACK.
       A.
       MOVE 'NEWPROG' TO WS-PGM.
