       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       SELECT C.ID FROM CLIENTE AS C JOIN CONTA X ON C.ID=X.ID
       END-EXEC.
       GOBACK.
