       IDENTIFICATION DIVISION.
       PROGRAM-ID. DECLTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ROOT-GROUP.
          05 BASE-ITEM PIC X(10) VALUE 'A' USAGE DISPLAY.
          05 REDEF-ITEM REDEFINES BASE-ITEM PIC X(10).
          05 TABLE-ITEM OCCURS 1 TO 10 TIMES
             DEPENDING ON TABLE-COUNT INDEXED BY TABLE-IDX
             PIC X.
          05 FILLER PIC X.
          05 TABLE-COUNT PIC 9(2) BLANK WHEN ZERO.
          88 VALID-COUNT VALUES 1 THRU 9, 11.
          66 RANGE-ALIAS RENAMES BASE-ITEM THRU TABLE-COUNT.
       77 STANDALONE PIC 9.
       LOCAL-STORAGE SECTION.
       01 LOCAL-ITEM PIC X.
       LINKAGE SECTION.
       01 LINK-PARAM PIC X.
       01 VALUE-PARAM PIC 9.
       PROCEDURE DIVISION USING BY REFERENCE OPTIONAL LINK-PARAM
                                BY VALUE VALUE-PARAM ANY
                          RETURNING TABLE-COUNT.
           GOBACK.
