       IDENTIFICATION DIVISION.
       PROGRAM-ID. REFTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GROUP-A.
          05 WS-SIMPLE PIC X.
          05 WS-INDEX PIC 9.
          05 WS-START PIC 9.
          05 WS-LENGTH PIC 9.
          05 WS-TABLE OCCURS 10 TIMES PIC X.
          05 WS-MATRIX OCCURS 10 TIMES.
             10 WS-CELL OCCURS 10 TIMES PIC 9.
       01 TARGET PIC X.
       PROCEDURE DIVISION.
           MOVE WS-SIMPLE TO TARGET.
           MOVE WS-SIMPLE OF GROUP-A TO TARGET.
           MOVE WS-SIMPLE IN GROUP-A TO TARGET.
           MOVE WS-SIMPLE OF GROUP-A OF OUTER-GROUP TO TARGET.
           MOVE WS-TABLE(WS-INDEX) TO TARGET.
           MOVE WS-TABLE OF GROUP-A(WS-INDEX) TO TARGET.
           MOVE WS-TABLE(WS-INDEX 1) TO TARGET.
           MOVE WS-CELL(1, 2)(3)
             TO TARGET.
           MOVE WS-SIMPLE(WS-START:WS-LENGTH) TO TARGET.
           MOVE WS-SIMPLE(WS-START:) TO TARGET.
           GOBACK.
