       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       DECLARE C1 CURSOR FOR SELECT * FROM CLIENTE
       END-EXEC.
       GOBACK.
