       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       INSERT INTO DESTINO(ID) SELECT ID FROM ORIGEM
       END-EXEC.
       GOBACK.
