       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RC PIC S9(8) COMP.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE ABEND LABEL(ERR) END-EXEC.
       PERFORM P.
       GOBACK.
       P.
       EXEC CICS ABEND END-EXEC.
       ERR.
       DISPLAY RC.
       ADJACENT.
       EXEC CICS ABEND END-EXEC.
