       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RC PIC S9(8) COMP.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE ABEND LABEL(ERR) END-EXEC.
       EXEC CICS ABEND END-EXEC.
       ERR.
       EXEC CICS HANDLE ABEND CANCEL END-EXEC.
       EXEC CICS ABEND END-EXEC.
