       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMPLE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RC PIC S9(8) COMP.
       PROCEDURE DIVISION.
       EXEC CICS HANDLE ABEND LABEL(ERR) END-EXEC.
       EXEC CICS ABEND END-EXEC.
       ERR.
       IF RC = 0
        EXEC CICS HANDLE ABEND RESET END-EXEC
       END-IF.
       EXEC CICS ABEND END-EXEC.
