       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGA.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT F ASSIGN TO DD001.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 FILE-RECORD PIC X(10).
       WORKING-STORAGE SECTION.
       COPY CPY001.
       EXEC SQL INCLUDE DCLCLI END-EXEC
       EXEC SQL INCLUDE GENERIC END-EXEC
       PROCEDURE DIVISION.
           OPEN INPUT F.
           READ F.
           CLOSE F.
           CALL 'SUBA'.
       EXEC SQL
       SELECT C.ID FROM DBPROD.CLIENTE C JOIN DBPROD.CONTA X ON
       X.ID=C.ID
       END-EXEC.
       GOBACK.
