       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       SELECT * FROM REALTABLE /* /* */ JOIN FAKE ON 1=1 */
       END-EXEC.
       GOBACK.
