       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY X OF LIB.
       COPY X IN LIB.
       PROCEDURE DIVISION.
           GOBACK.
