       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       SELECT ID INTO :WS-ID FROM CLIENTE WHERE ID=:WS-ID
       END-EXEC.
       GOBACK.
