       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       MERGE INTO CONTA C USING AJUSTE A ON C.ID=A.ID WHEN MATCHED
       THEN UPDATE SET SALDO=A.SALDO WHEN NOT MATCHED THEN
       INSERT(ID) VALUES(A.ID)
       END-EXEC.
       GOBACK.
