       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       *> COPY CPY001.
       01 TEXT-A PIC X(30) VALUE " COPY CPY001 ".
       PROCEDURE DIVISION.
           GOBACK.
