       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       MOVE 'SELECT * FROM FAKE' TO WS-SQL.
       EXEC SQL
       PREPARE S1 FROM :WS-SQL
       END-EXEC.
       GOBACK.
