       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGA.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT F ASSIGN TO DD001.
       DATA DIVISION.
       FILE SECTION.
       FD F.
       01 FILE-RECORD PIC X(10).
       WORKING-STORAGE SECTION.
       COPY CPY001.
       EXEC SQL INCLUDE DCLCLI END-EXEC
       PROCEDURE DIVISION.
           OPEN INPUT F.
           READ F.
           CLOSE F.
           CALL 'SUBA'.
           GOBACK.
