       IDENTIFICATION DIVISION.
       PROGRAM-ID. INLINECE.
       AUTHOR. ORIGINAL AUTHOR.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VALUE-A PIC X.
       PROCEDURE DIVISION.
           MOVE 'X' TO VALUE-A.
           GOBACK.
