       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROVTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY FIRST REPLACING ==:TAG:== BY ==RENAMED==.
       COPY MISSING.
       PROCEDURE DIVISION.
           MOVE 'X' TO RENAMED-FIELD.
           GOBACK.
