       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       SELECT * FROM (SELECT * FROM CLIENTE) X JOIN CONTA C ON
       X.ID=C.ID
       END-EXEC.
       GOBACK.
