       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-SQL PIC X(80).
       PROCEDURE DIVISION.
       EXEC SQL
       SELECT C.ID FROM CLIENTE C JOIN CONTA X ON X.ID=C.ID LEFT
       JOIN SALDO S ON S.ID=C.ID INNER JOIN MOVIMENTO M ON
       M.ID=C.ID
       END-EXEC.
       GOBACK.
