       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC X(8).
       01 WS-B PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'PROGA' TO WS-A.
       MOVE WS-A TO WS-B.
       CALL WS-B.
       MOVE 'PROGB' TO WS-A.
       CALL WS-A.
       CALL WS-B.
       GOBACK.
