       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CPY001.
       COPY CPY002.
       PROCEDURE DIVISION.
           GOBACK.
