       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARTIAL-DISPLAY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC X(8).
       PROCEDURE DIVISION.
           CALL 'BEFORE'.
           DISPLAY 'X' ON EXCEPTION MOVE 'UNKNOWN' TO WS-A
           END-DISPLAY.
           CALL 'AFTER'.
           GOBACK.
