       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARTIAL-PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC X(8).
       01 WS-B PIC X(8).
       01 FLAG PIC X.
       LINKAGE SECTION.
       01 ARG PIC X(8).
       PROCEDURE DIVISION USING ARG.
       MOVE 'PROGA' TO WS-A.
       CALL WS-A.
       DISPLAY WS-A.
       GOBACK.
