       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARTIAL-PGM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT FILE-A ASSIGN TO 'INPUT'.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-A.
       01 FILE-REC PIC X(8).
       WORKING-STORAGE SECTION.
       01 WS-A PIC X(8).
       01 WS-REC PIC X(8).
       PROCEDURE DIVISION.
       MOVE 'PROGA' TO WS-A.
       READ FILE-A INTO WS-REC.
       CALL WS-A.
       GOBACK.
