IDENTIFICATION DIVISION.
PROGRAM-ID. GOTOTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PGM PIC X(8).
01 FLAG PIC X.
01 WS-X PIC X.
01 IDX PIC 9.
PROCEDURE DIVISION.
MOVE 'PROGA' TO WS-PGM.
GO TO TARGET-0.
MOVE 'BADPROG' TO WS-PGM.
TARGET-0.
CALL WS-PGM.
MOVE 'PROGA' TO WS-PGM.
GO TO TARGET-1.
MOVE 'BADPROG' TO WS-PGM.
TARGET-1.
CALL WS-PGM.
MOVE 'PROGA' TO WS-PGM.
GO TO TARGET-2.
MOVE 'BADPROG' TO WS-PGM.
TARGET-2.
CALL WS-PGM.
MOVE 'PROGA' TO WS-PGM.
GO TO TARGET-3.
MOVE 'BADPROG' TO WS-PGM.
TARGET-3.
CALL WS-PGM.
MOVE 'PROGA' TO WS-PGM.
GO TO TARGET-4.
MOVE 'BADPROG' TO WS-PGM.
TARGET-4.
CALL WS-PGM.
GOBACK.
