IDENTIFICATION DIVISION.
PROGRAM-ID. GOTOTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PGM PIC X(8).
01 FLAG PIC X.
01 WS-X PIC X.
01 IDX PIC 9.
PROCEDURE DIVISION.
GO TO PARA-A PARA-B PARA-C DEPENDING ON IDX.
CALL 'PROGA'.
GOBACK.
PARA-A.
GOBACK.
PARA-B.
GOBACK.
PARA-C.
GOBACK.
