IDENTIFICATION DIVISION.
PROGRAM-ID. GOTOTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PGM PIC X(8).
01 FLAG PIC X.
01 WS-X PIC X.
01 IDX PIC 9.
PROCEDURE DIVISION.
MOVE 'PROGA' TO WS-PGM.
EVALUATE WS-X
WHEN 'A' GO TO TARGET
WHEN OTHER MOVE 'PROGB' TO WS-PGM
END-EVALUATE.
MOVE 'OTHER' TO WS-PGM.
GO TO TARGET.
TARGET.
CALL WS-PGM.
GOBACK.
