IDENTIFICATION DIVISION.
PROGRAM-ID. GOTOTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PGM PIC X(8).
01 FLAG PIC X.
01 WS-X PIC X.
01 IDX PIC 9.
PROCEDURE DIVISION.
MOVE 'PROGA' TO WS-PGM.
GO TO FIRST-TARGET.
MOVE 'BADPROG' TO WS-PGM.
FIRST-TARGET.
CALL WS-PGM.
MOVE 'PROGB' TO WS-PGM.
GO TO SECOND-TARGET.
MOVE 'BADPROG' TO WS-PGM.
SECOND-TARGET.
CALL WS-PGM.
CALL 'PROGC'.
GOBACK.
