IDENTIFICATION DIVISION.
PROGRAM-ID. GOTOTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PGM PIC X(8).
01 FLAG PIC X.
01 WS-X PIC X.
01 IDX PIC 9.
PROCEDURE DIVISION.
EVALUATE WS-X
WHEN 'A' MOVE 'PROGA' TO WS-PGM
WHEN OTHER MOVE 'PROGB' TO WS-PGM
END-EVALUATE.
GO TO TARGET.
MOVE 'BADPROG' TO WS-PGM.
TARGET.
CALL WS-PGM.
GOBACK.
