IDENTIFICATION DIVISION.
PROGRAM-ID. GOTOTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PGM PIC X(8).
01 FLAG PIC X.
01 WS-X PIC X.
01 IDX PIC 9.
PROCEDURE DIVISION.
MAIN.
PERFORM SET-PGM.
CALL WS-PGM.
GOBACK.
SET-PGM.
MOVE 'PROGA' TO WS-PGM.
UNREACHABLE-PARA.
GO TO LAST-PARA.
LAST-PARA.
GOBACK.
