IDENTIFICATION DIVISION.
PROGRAM-ID. GOTOTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-PGM PIC X(8).
01 FLAG PIC X.
01 WS-X PIC X.
01 IDX PIC 9.
PROCEDURE DIVISION.
GO TO TARGET IN SEC-A.
MOVE 'BADPROG' TO WS-PGM.
SEC-A SECTION.
TARGET.
MOVE 'PROGA' TO WS-PGM.
CALL WS-PGM.
GOBACK.
SEC-B SECTION.
TARGET.
GOBACK.
