       IDENTIFICATION DIVISION.
       PROGRAM-ID. ABBREVIATED-CONDITION-CONTEXT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC X.
       01 B PIC X.
       01 C PIC X.
       01 D PIC X.
       PROCEDURE DIVISION.
           IF A = B OR C OR D
               CONTINUE
           END-IF.
       END PROGRAM ABBREVIATED-CONDITION-CONTEXT.
