       CBL DYNAM,NODLL
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-IDENTIFIER-RUNTIME-TARGET.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CALL-NAME PIC X(8) VALUE 'TARGET-A'.
       PROCEDURE DIVISION.
           CALL CALL-NAME.
           GOBACK.
       END PROGRAM CALL-IDENTIFIER-RUNTIME-TARGET.
