       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-LINKAGE-UNSPECIFIED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CALL-NAME PIC X(8) VALUE 'TARGET-A'.
       PROCEDURE DIVISION.
           CALL 'TARGET-A'.
           CALL CALL-NAME.
           GOBACK.
       END PROGRAM CALL-LINKAGE-UNSPECIFIED.
