       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMON-ROOT.
       PROCEDURE DIVISION.
           CALL 'COMMON-C'.
           CALL 'DEEP-C'.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SIBLING.
       PROCEDURE DIVISION.
           CALL 'COMMON-C'.
           CALL 'PRIVATE-SIBLING'.
           GOBACK.
       END PROGRAM SIBLING.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMON-C IS COMMON PROGRAM.
       PROCEDURE DIVISION.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DESCENDANT.
       PROCEDURE DIVISION.
           CALL 'COMMON-C'.
           GOBACK.
       END PROGRAM DESCENDANT.
       END PROGRAM COMMON-C.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRIVATE-SIBLING.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM PRIVATE-SIBLING.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. A.
       PROCEDURE DIVISION.
           CALL 'DEEP-C'.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. B.
       PROCEDURE DIVISION.
           CALL 'DEEP-C'.
           GOBACK.
       END PROGRAM B.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEEP-C IS COMMON PROGRAM.
       PROCEDURE DIVISION.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. D.
       PROCEDURE DIVISION.
           CALL 'DEEP-C'.
           GOBACK.
       END PROGRAM D.
       END PROGRAM DEEP-C.
       END PROGRAM A.
       END PROGRAM COMMON-ROOT.
