       IDENTIFICATION DIVISION.
       PROGRAM-ID. EVALUATECONDITION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STATUS-FIELD PIC X.
          88 STATUS-OPEN VALUE 'O'.
          88 STATUS-CLOSED VALUE 'C'.
       01 FLAG-DATA PIC X.
          88 FLAG-DATA VALUE 'Y'.
       01 DATA-ITEM PIC X.
       01 OUTPUT-ITEM PIC X.
       PROCEDURE DIVISION.
           EVALUATE TRUE
               WHEN STATUS-OPEN MOVE DATA-ITEM TO OUTPUT-ITEM
               WHEN NOT STATUS-CLOSED CONTINUE
               WHEN MISSING-CONDITION CONTINUE
               WHEN DATA-ITEM = 'A' CONTINUE
           END-EVALUATE
           EVALUATE FALSE
               WHEN STATUS-CLOSED CONTINUE
           END-EVALUATE
           EVALUATE TRUE ALSO DATA-ITEM
               WHEN FLAG-DATA ALSO DATA-ITEM CONTINUE
           END-EVALUATE
           EVALUATE DATA-ITEM
               WHEN DATA-ITEM CONTINUE
               WHEN 'A' THRU 'Z' CONTINUE
           END-EVALUATE.
