       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEBIND.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BOTH-FILE ASSIGN TO 'BOTHDD'.
           SELECT SELECT-ONLY ASSIGN TO 'SELECTDD'.
       DATA DIVISION.
       FILE SECTION.
       FD BOTH-FILE.
       01 BOTH-RECORD PIC X(10).
       FD FD-ONLY.
       01 FD-RECORD PIC X(10).
       PROCEDURE DIVISION.
           OPEN INPUT BOTH-FILE SELECT-ONLY FD-ONLY MISSING-FILE.
           CALL 'FILE-HELPER' USING BOTH-FILE.
           GOBACK.
       END PROGRAM FILEBIND.
