       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILLER-REDEFINES-OWNER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 W3D-AUX PIC X(38) VALUE SPACES.
       01 FILLER REDEFINES W3D-AUX PIC X(38).
       PROCEDURE DIVISION.
           MOVE SPACES TO W3D-AUX.
           GOBACK.
       END PROGRAM FILLER-REDEFINES-OWNER.
