       IDENTIFICATION DIVISION.
       PROGRAM-ID. GLOBAL-FD-OUTER.
       DATA DIVISION.
       FILE SECTION.
       FD CUSTOMER-FILE IS GLOBAL.
       01 CUSTOMER-RECORD.
          05 CUSTOMER-ID PIC X(10).
          05 CUSTOMER-STATUS PIC X.
             88 CUSTOMER-OK VALUE 'Y'.
          05 CUSTOMER-TABLE OCCURS 2 INDEXED BY CUSTOMER-IDX.
             10 CUSTOMER-VALUE PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. GLOBAL-FD-INNER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT-X PIC X(10).
       PROCEDURE DIVISION.
           MOVE CUSTOMER-RECORD TO RESULT-X.
           MOVE CUSTOMER-ID TO RESULT-X.
           IF CUSTOMER-OK
               MOVE CUSTOMER-VALUE(CUSTOMER-IDX) TO RESULT-X
           END-IF.
           GOBACK.
       END PROGRAM GLOBAL-FD-INNER.
       END PROGRAM GLOBAL-FD-OUTER.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOCAL-FD-OUTER.
       DATA DIVISION.
       FILE SECTION.
       FD LOCAL-FILE.
       01 LOCAL-RECORD.
          05 LOCAL-ID PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOCAL-FD-INNER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 LOCAL-RESULT PIC X.
       PROCEDURE DIVISION.
           MOVE LOCAL-ID TO LOCAL-RESULT.
           GOBACK.
       END PROGRAM LOCAL-FD-INNER.
       END PROGRAM LOCAL-FD-OUTER.
