       IDENTIFICATION DIVISION.
       PROGRAM-ID. INDEX-RELATIONAL-OPERATORS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-X OCCURS 10 TIMES INDEXED BY TABLE-IDX.
          05 TABLE-VALUE PIC X.
       PROCEDURE DIVISION.
           IF TABLE-IDX = 1 CONTINUE END-IF.
           IF TABLE-IDX EQUAL TO 1 CONTINUE END-IF.
           IF TABLE-IDX IS EQUAL TO 1 CONTINUE END-IF.
           IF TABLE-IDX IS NOT EQUAL TO 1 CONTINUE END-IF.
           IF TABLE-IDX > 1 CONTINUE END-IF.
           IF TABLE-IDX GREATER THAN 1 CONTINUE END-IF.
           IF TABLE-IDX IS NOT GREATER THAN 1 CONTINUE END-IF.
           IF TABLE-IDX >= 1 CONTINUE END-IF.
           IF TABLE-IDX GREATER THAN OR EQUAL TO 1 CONTINUE END-IF.
           IF TABLE-IDX < 1 CONTINUE END-IF.
           IF TABLE-IDX LESS THAN 1 CONTINUE END-IF.
           IF TABLE-IDX IS NOT LESS THAN 1 CONTINUE END-IF.
           IF TABLE-IDX <= 1 CONTINUE END-IF.
           IF TABLE-IDX LESS THAN OR EQUAL TO 1 CONTINUE END-IF.
           IF TABLE-IDX <> 1 CONTINUE END-IF.
           GOBACK.
       END PROGRAM INDEX-RELATIONAL-OPERATORS.
