       IDENTIFICATION DIVISION.
       PROGRAM-ID. INDEX-VALUE-CONTEXT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TABLE-X OCCURS 10 TIMES INDEXED BY TABLE-IDX.
          05 TABLE-VALUE PIC X.
       01 RESULT-X PIC X.
       PROCEDURE DIVISION.
           MOVE TABLE-VALUE(TABLE-IDX) TO RESULT-X.
           SET TABLE-IDX TO 1.
           IF TABLE-IDX > 0
               CONTINUE
           END-IF.
           GOBACK.
       END PROGRAM INDEX-VALUE-CONTEXT.
