       CBL DYNAM,DLL
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVALID-DYNAM-DLL-CALLER.
       PROCEDURE DIVISION.
           CALL 'TARGET-A'.
           GOBACK.
       END PROGRAM INVALID-DYNAM-DLL-CALLER.
