       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTER-LITERAL.
       PROCEDURE DIVISION.
           CALL 'CHILD'.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'CHILD'.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM 'CHILD'.
       END PROGRAM OUTER-LITERAL.
