       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-OUTER.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT GLOBAL-BOTH ASSIGN TO 'GLOBALDD'.
           SELECT OUTER-LOCAL ASSIGN TO 'LOCALDD'.
           SELECT SHADOW-FILE ASSIGN TO 'OUTERDD'.
       DATA DIVISION.
       FILE SECTION.
       FD GLOBAL-BOTH IS GLOBAL.
       01 GLOBAL-BOTH-RECORD PIC X.
       FD OUTER-LOCAL.
       01 OUTER-LOCAL-RECORD PIC X.
       FD SHADOW-FILE IS GLOBAL.
       01 OUTER-SHADOW-RECORD PIC X.
       FD GLOBAL-FD-ONLY IS GLOBAL.
       01 GLOBAL-FD-RECORD PIC X.
       PROCEDURE DIVISION.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-INNER.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SHADOW-FILE ASSIGN TO 'INNERDD'.
       DATA DIVISION.
       FILE SECTION.
       FD SHADOW-FILE.
       01 INNER-SHADOW-RECORD PIC X.
       PROCEDURE DIVISION.
           READ GLOBAL-BOTH.
           READ OUTER-LOCAL.
           READ GLOBAL-FD-ONLY.
           READ SHADOW-FILE.
           GOBACK.
       END PROGRAM FILE-INNER.
       END PROGRAM FILE-OUTER.
