       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDEFINES-DIFFERENT-LEVEL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GROUP-A.
          05 ITEM-A PIC X.
          04 ITEM-B REDEFINES ITEM-A PIC X.
       01 GROUP-B.
          05 OTHER-X PIC X.
       01 GROUP-C.
          05 BAD-X REDEFINES OTHER-X PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM REDEFINES-DIFFERENT-LEVEL.
