       IDENTIFICATION DIVISION.
       PROGRAM-ID. REDEFINES-POSITIONAL-TARGET.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GROUP-A.
          05 X PIC X.
          05 FILLER PIC X.
          05 X PIC X.
          05 Y REDEFINES X PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM REDEFINES-POSITIONAL-TARGET.
