       IDENTIFICATION DIVISION.
       PROGRAM-ID. RENAMES-STRUCTURE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RECORD-A.
          05 START-X PIC X.
          05 END-X PIC X.
          66 RANGE-A RENAMES START-X THRU END-X.
       01 RECORD-B.
          05 START-X PIC X.
          05 END-X PIC X.
       01 RECORD-C.
          05 CROSS-START PIC X.
       01 RECORD-D.
          05 CROSS-END PIC X.
          66 CROSS-RANGE RENAMES CROSS-START THRU CROSS-END.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM RENAMES-STRUCTURE.
