       IDENTIFICATION DIVISION.
       PROGRAM-ID. SETCONDITION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 STATUS-FIELD PIC X.
          88 STATUS-OPEN VALUE 'O'.
          88 STATUS-CLOSED VALUE 'C'.
       01 FLAG-DATA PIC X.
          88 FLAG-DATA VALUE 'Y'.
       01 SOURCE-VALUE PIC X.
       01 TABLE-ITEM OCCURS 1 TO 2 TIMES INDEXED BY TABLE-IDX PIC X.
       PROCEDURE DIVISION.
           SET STATUS-OPEN STATUS-CLOSED TO TRUE.
           SET STATUS-OPEN TO FALSE.
           SET FLAG-DATA TO TRUE.
           SET SOURCE-VALUE TO FLAG-DATA.
           SET TABLE-IDX UP BY 1.
           GOBACK.
       END PROGRAM SETCONDITION.
