       CBL NODYNAM,NODLL,PGMNAME(LONGMIXED)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. STATIC-EXTERNAL-CALLER.
       PROCEDURE DIVISION.
           CALL 'LONG-NAME-ABC'.
           CALL '1PROG'.
           CALL 'mixed-Child'.
           GOBACK.
       END PROGRAM STATIC-EXTERNAL-CALLER.
