       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBSCRIPT-KIND.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SUBSCRIPT-NUM PIC 9(4).
       01 TABLE-X OCCURS 100 TIMES INDEXED BY TABLE-IDX.
          05 TABLE-VALUE PIC X.
       01 RESULT-X PIC X.
       PROCEDURE DIVISION.
           MOVE TABLE-VALUE(SUBSCRIPT-NUM) TO RESULT-X.
           MOVE TABLE-VALUE(TABLE-IDX) TO RESULT-X.
           GOBACK.
       END PROGRAM SUBSCRIPT-KIND.
