       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIRST-PROGRAM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TEST-FILE ASSIGN TO 'TESTDD'.
       DATA DIVISION.
       FILE SECTION.
       FD TEST-FILE.
       01 TEST-RECORD PIC X(10).
       WORKING-STORAGE SECTION.
       01 WS-VALUE PIC X(10).
       PROCEDURE DIVISION.
           READ TEST-FILE INTO WS-VALUE.
           CALL 'EXTERNAL-PROGRAM'.
           GO TO FINISH-FIRST.
       FINISH-FIRST.
           GOBACK.
       END PROGRAM FIRST-PROGRAM.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SECOND-PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SECOND-VALUE PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM SECOND-PROGRAM.
