       CBL NODYNAM,DLL
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-LINKAGE-DLL.
       PROCEDURE DIVISION.
           CALL 'TARGET-A'.
           GOBACK.
       END PROGRAM CALL-LINKAGE-DLL.
