       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTER-PROGRAM IS COMMON PROGRAM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUSTOMER-FILE ASSIGN TO 'CUSTOMER'.
       DATA DIVISION.
       FILE SECTION.
       FD CUSTOMER-FILE IS GLOBAL.
       01 CUSTOMER-RECORD PIC X(20).
       WORKING-STORAGE SECTION.
       01 SHARED-NAME IS GLOBAL PIC X.
       01 EXTERNAL-NAME IS EXTERNAL PIC X.
       PROCEDURE DIVISION.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHILD-ONE IS INITIAL PROGRAM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SHARED-NAME PIC X.
       PROCEDURE DIVISION.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. GRANDCHILD.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM GRANDCHILD.
       END PROGRAM CHILD-ONE.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. CHILD-TWO IS RECURSIVE PROGRAM.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM CHILD-TWO.
       END PROGRAM OUTER-PROGRAM.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SECOND-TOP.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM SECOND-TOP.
