       IDENTIFICATION DIVISION.
       PROGRAM-ID. QUALIFIER-COLLISION.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT QUALIFIER-X ASSIGN TO 'QUALDD'.
       DATA DIVISION.
       FILE SECTION.
       FD QUALIFIER-X.
       01 FILE-RECORD.
          05 ITEM PIC X.
       WORKING-STORAGE SECTION.
       01 QUALIFIER-X.
          05 FILE-RECORD.
             10 ITEM PIC X.
       01 TARGET-X PIC X.
       PROCEDURE DIVISION.
           MOVE ITEM OF QUALIFIER-X TO TARGET-X.
           MOVE ITEM OF FILE-RECORD IN QUALIFIER-X TO TARGET-X.
           MOVE LINAGE-COUNTER IN QUALIFIER-X TO TARGET-X.
           GOBACK.
       END PROGRAM QUALIFIER-COLLISION.
