       CBL DYNAM,PGMNAME(LONGMIXED)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DYNAMIC-EXTERNAL-CALLER.
       PROCEDURE DIVISION.
           CALL 'LONG-NAME-ABC'.
           CALL '1PROG'.
           CALL 'mixed-Child'.
           GOBACK.
       END PROGRAM DYNAMIC-EXTERNAL-CALLER.
