       IDENTIFICATION DIVISION.
       PROGRAM-ID. ENTITYTEST.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT BOTH-FILE ASSIGN TO 'BOTHDD'.
           SELECT SELECT-ONLY ASSIGN TO 'SELECTDD'.
       DATA DIVISION.
       FILE SECTION.
       FD BOTH-FILE.
       01 BOTH-RECORD.
          05 FILE-VALUE PIC X(10).
       FD FD-ONLY.
       01 FD-ONLY-RECORD PIC X.
       SD SORT-FILE.
       01 SORT-RECORD PIC X.
       WORKING-STORAGE SECTION.
       01 BASE-GROUP.
          05 BASE-ITEM PIC X(10).
          05 REDEF-ITEM REDEFINES BASE-ITEM PIC X(10).
          05 TABLE-ITEM OCCURS 1 TO 10 TIMES
             DEPENDING ON TABLE-COUNT INDEXED BY TABLE-IDX
             PIC X.
          05 TABLE-COUNT PIC 9(2).
          66 RANGE-ALIAS RENAMES BASE-ITEM THRU TABLE-COUNT.
       01 WS-TARGET PIC X(10).
       01 WS-IDX PIC 9.
       01 WS-OFFSET PIC 9.
       01 WS-LENGTH PIC 9.
       PROCEDURE DIVISION.
           MOVE FILE-VALUE OF BOTH-RECORD IN BOTH-FILE
             TO WS-TARGET(WS-IDX)(WS-OFFSET:WS-LENGTH).
           MOVE LINAGE-COUNTER IN BOTH-FILE TO WS-TARGET.
           DISPLAY WS-TARGET.
           GOBACK.
       END PROGRAM ENTITYTEST.
