       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-SHADOW-OUTER.
       DATA DIVISION.
       FILE SECTION.
       FD DATA-X IS GLOBAL.
       01 OUTER-DATA-RECORD PIC X.
       FD CONDITION-X IS GLOBAL.
       01 OUTER-CONDITION-RECORD PIC X.
       FD INDEX-X IS GLOBAL.
       01 OUTER-INDEX-RECORD PIC X.
       FD FILE-X IS GLOBAL.
       01 OUTER-FILE-RECORD PIC X.
       FD CONTROL-FILE IS GLOBAL.
       01 OUTER-CONTROL-RECORD PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-SHADOW-INNER.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-X.
       01 INNER-FILE-RECORD PIC X.
       WORKING-STORAGE SECTION.
       01 DATA-X PIC X.
       01 STATUS-X PIC X.
          88 CONDITION-X VALUE 'Y'.
       01 TABLE-X OCCURS 2 INDEXED BY INDEX-X.
          05 TABLE-VALUE PIC X.
       PROCEDURE DIVISION.
           READ DATA-X.
           READ CONDITION-X.
           READ INDEX-X.
           READ FILE-X.
           READ CONTROL-FILE.
           GOBACK.
       END PROGRAM FILE-SHADOW-INNER.
       END PROGRAM FILE-SHADOW-OUTER.
