       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATA-OUTER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 GLOBAL-DATA IS GLOBAL PIC X.
       01 OUTER-LOCAL PIC X.
       PROCEDURE DIVISION.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATA-CHILD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 OUTER-LOCAL PIC X.
       01 CHILD-TARGET PIC X.
       01 EXTERNAL-DATA IS EXTERNAL PIC X.
       PROCEDURE DIVISION.
           MOVE OUTER-LOCAL TO CHILD-TARGET.
           MOVE GLOBAL-DATA TO CHILD-TARGET.
           MOVE EXTERNAL-DATA TO CHILD-TARGET.
           MOVE NOT-VISIBLE TO CHILD-TARGET.
           GOBACK.
       END PROGRAM DATA-CHILD.
       END PROGRAM DATA-OUTER.
