       IDENTIFICATION DIVISION.
       PROGRAM-ID. QUALIFY-OUTER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 OUTER-GROUP IS GLOBAL.
          05 VALUE-X PIC X.
       PROCEDURE DIVISION.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. QUALIFY-INNER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 INNER-GROUP.
          05 VALUE-X PIC X.
       01 INNER-TARGET PIC X.
       PROCEDURE DIVISION.
           MOVE VALUE-X TO INNER-TARGET.
           MOVE VALUE-X OF INNER-GROUP TO INNER-TARGET.
           MOVE VALUE-X OF OUTER-GROUP TO INNER-TARGET.
           GOBACK.
       END PROGRAM QUALIFY-INNER.
       END PROGRAM QUALIFY-OUTER.
