       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-OUTER-A.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-X IS GLOBAL.
       01 OUTER-A-RECORD PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-MIDDLE-A.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-X.
       01 MIDDLE-A-RECORD PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-INNER-A.
       PROCEDURE DIVISION.
           READ FILE-X.
           GOBACK.
       END PROGRAM FILE-INNER-A.
       END PROGRAM FILE-MIDDLE-A.
       END PROGRAM FILE-OUTER-A.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-OUTER-B.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-X IS GLOBAL.
       01 OUTER-B-RECORD PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-MIDDLE-B.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-X IS GLOBAL.
       01 MIDDLE-B-RECORD PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-INNER-B.
       PROCEDURE DIVISION.
           READ FILE-X.
           GOBACK.
       END PROGRAM FILE-INNER-B.
       END PROGRAM FILE-MIDDLE-B.
       END PROGRAM FILE-OUTER-B.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-OUTER-C.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-X IS GLOBAL.
       01 OUTER-C-RECORD PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-MIDDLE-C.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-X.
       01 MIDDLE-C-RECORD PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-INNER-C.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-X.
       01 INNER-C-RECORD PIC X.
       PROCEDURE DIVISION.
           READ FILE-X.
           GOBACK.
       END PROGRAM FILE-INNER-C.
       END PROGRAM FILE-MIDDLE-C.
       END PROGRAM FILE-OUTER-C.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-OUTER-D.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-MIDDLE-D.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-X.
       01 MIDDLE-D-RECORD PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILE-INNER-D.
       PROCEDURE DIVISION.
           READ FILE-X.
           GOBACK.
       END PROGRAM FILE-INNER-D.
       END PROGRAM FILE-MIDDLE-D.
       END PROGRAM FILE-OUTER-D.
