       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHADOW-OUTER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 COLLIDE-CONDITION IS GLOBAL PIC X.
       01 COLLIDE-INDEX IS GLOBAL PIC X.
       01 CONTROL-GLOBAL IS GLOBAL PIC X.
       PROCEDURE DIVISION.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. SHADOW-INNER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 LOCAL-FLAG PIC X.
          88 COLLIDE-CONDITION VALUE 'Y'.
       01 LOCAL-TABLE OCCURS 2 TIMES
          INDEXED BY COLLIDE-INDEX PIC X.
       01 INNER-TARGET PIC X.
       PROCEDURE DIVISION.
           MOVE COLLIDE-CONDITION TO INNER-TARGET.
           MOVE COLLIDE-INDEX TO INNER-TARGET.
           MOVE CONTROL-GLOBAL TO INNER-TARGET.
           GOBACK.
       END PROGRAM SHADOW-INNER.
       END PROGRAM SHADOW-OUTER.
