       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTER-A.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X IS GLOBAL PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIDDLE-A.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INNER-A.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT-A PIC X.
       PROCEDURE DIVISION.
           MOVE X TO RESULT-A.
           GOBACK.
       END PROGRAM INNER-A.
       END PROGRAM MIDDLE-A.
       END PROGRAM OUTER-A.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTER-B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X IS GLOBAL PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIDDLE-B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X IS GLOBAL PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INNER-B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT-B PIC X.
       PROCEDURE DIVISION.
           MOVE X TO RESULT-B.
           GOBACK.
       END PROGRAM INNER-B.
       END PROGRAM MIDDLE-B.
       END PROGRAM OUTER-B.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTER-C.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X IS GLOBAL PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIDDLE-C.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INNER-C.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC X.
       01 RESULT-C PIC X.
       PROCEDURE DIVISION.
           MOVE X TO RESULT-C.
           GOBACK.
       END PROGRAM INNER-C.
       END PROGRAM MIDDLE-C.
       END PROGRAM OUTER-C.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. OUTER-D.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIDDLE-D.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC X.
       PROCEDURE DIVISION.
           GOBACK.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. INNER-D.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 RESULT-D PIC X.
       PROCEDURE DIVISION.
           MOVE X TO RESULT-D.
           GOBACK.
       END PROGRAM INNER-D.
       END PROGRAM MIDDLE-D.
       END PROGRAM OUTER-D.
