       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROCBIND.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SELECTOR PIC 9.
       PROCEDURE DIVISION.
           GO TO UNIQUE-PARA.
           GO TO DUPLICATE-PARA.
           GO TO DUPLICATE-PARA OF SECTION-A.
           GO TO FIRST-PARA SECOND-PARA DEPENDING ON SELECTOR.
           PERFORM FIRST-PARA THRU SECOND-PARA.
           ALTER FIRST-PARA TO PROCEED TO SECOND-PARA.
           GO TO CHILD-ONLY.
       UNIQUE-PARA.
           CONTINUE.
       FIRST-PARA.
           CONTINUE.
       SECOND-PARA.
           CONTINUE.
       SECTION-A SECTION.
       DUPLICATE-PARA.
           CONTINUE.
       SECTION-B SECTION.
       DUPLICATE-PARA.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROC-CHILD.
       PROCEDURE DIVISION.
       CHILD-ONLY.
           GOBACK.
       END PROGRAM PROC-CHILD.
       END PROGRAM PROCBIND.
