       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAM-OUTER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CALL-TARGET PIC X(20).
       PROCEDURE DIVISION.
           CALL 'PRIVATE-CHILD'.
           CALL 'COMMON-CHILD'.
           CALL 'DUPLICATE-CHILD'.
           CALL 'EXTERNAL-ONE'.
           CALL 'EXTERNAL-MANY'.
           CALL WS-CALL-TARGET.
           GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRIVATE-CHILD.
       PROCEDURE DIVISION.
           CALL 'COMMON-CHILD'.
           CALL 'PRIVATE-SIBLING'.
           GOBACK.
       END PROGRAM PRIVATE-CHILD.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMON-CHILD IS COMMON PROGRAM.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM COMMON-CHILD.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRIVATE-SIBLING.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM PRIVATE-SIBLING.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DUPLICATE-CHILD.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM DUPLICATE-CHILD.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. DUPLICATE-CHILD.
       PROCEDURE DIVISION.
           GOBACK.
       END PROGRAM DUPLICATE-CHILD.
       END PROGRAM PROGRAM-OUTER.
