       IDENTIFICATION DIVISION.
       PROGRAM-ID. POLICY-CALLER.
       PROCEDURE DIVISION.
           CALL 'SIMPLE'.
           CALL 'mixed-Child'.
           CALL 'LONG-NAME-ABC'.
           GOBACK.
       END PROGRAM POLICY-CALLER.
