       CBL PGMNAME(LONGMIXED)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNKNOWN-LINKAGE-CALLER.
       PROCEDURE DIVISION.
           CALL 'LONG-NAME-ABC'.
           CALL '1PROG'.
           CALL 'mixed-Child'.
           GOBACK.
       END PROGRAM UNKNOWN-LINKAGE-CALLER.
