       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNKNOWN-LINKAGE-SAME-TARGET.
       PROCEDURE DIVISION.
           CALL 'TARGET-A'.
           GOBACK.
       END PROGRAM UNKNOWN-LINKAGE-SAME-TARGET.
