       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNSPECIFIED-EXTERNAL-CALLER.
       PROCEDURE DIVISION.
           CALL 'SIMPLE'.
           CALL '1PROG'.
           GOBACK.
       END PROGRAM UNSPECIFIED-EXTERNAL-CALLER.
