       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       *> EXEC SQL INCLUDE FAKE END-EXEC
       01 TEXT-A PIC X(40) VALUE "EXEC SQL INCLUDE FAKE END-EXEC".
       PROCEDURE DIVISION.
           GOBACK.
